const mangadatas = [
  {
    id: 1,
    title: "親愛なる君へ殺意を込めて",
    cover_url: "/covers/cover-1.jpg",
    description:
      "「人生は楽しんだもん勝ち」がモットーの大学生・浦島エイジ。だが彼は、人には言えない“過酷な運命”を背負っていた。その現実と向き合った時、彼は惨劇に巻き込まれていく―――。",
  },
  {
    id: 2,
    title: "キングダム",
    cover_url: "/covers/cover-2.jpg",
    description:
      "時は紀元前――。いまだ一度も統一されたことのない中国大陸は、500年の大戦争時代。苛烈な戦乱の世に生きる少年・信は、自らの腕で天下に名を成すことを目指す!! 2013年、第17回手塚治虫文化賞マンガ大賞受賞!",
  },
  {
    id: 3,
    title: "君と宇宙を歩くために",
    cover_url: "/covers/cover-3.jpg",
    description:
      "ヤンキーの小林は、勉強もバイトも続かず悩んでいたが、転校生の宇野と出会い、彼の生き方に惹かれる。宇野に助けられたことをきっかけに、2人の距離が縮まり、小林は自分を変えようと奮闘する。正反対の2人が互いに壁にぶつかりながらも成長していく友情物語。",
  },
  {
    id: 4,
    title: "トリリオンゲーム",
    cover_url: "/covers/cover-4.jpg",
    description:
      "稲垣理一郎&池上遼一の最強タッグ!! 1,000,000,000,000$稼いで、この世の全てを手に入れろ! 世界一のワガママ男・ハルと、まじめなガク。最強の二人がゼロから起業、ミラクルを起こす!! グーグル、アマゾン、マイクロソフトを喰う! 『Dr.STONE』の稲垣理一郎と『サンクチュアリ』の池上遼一が放つ、最新にして最高! スタートアップコミックの決定版、誕生!!",
  },
];

export { mangadatas };
