const users = [
  {
    id: "410544b2-4001-4271-9855-fec4b6a6442a",
    name: "User",
    email: "user@nextmail.com",
    password: "123456",
  },
];

const userlikes = [
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 1 },
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 3 },
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 6 },
];

const mangadatas = [
  {
    id: 1,
    title: "親愛なる僕へ殺意を込めて",
    cover_url: "/new-covers/cover-1.webp",
    description:
      "「人生は楽しんだもん勝ち」がモットーの大学生・浦島エイジ。だが彼は、人には言えない“過酷な運命”を背負っていた。その現実と向き合った時、彼は惨劇に巻き込まれていく―――。",
    likes: 1340,
    amazon_url: "https://amzn.to/4edLsqr",
  },
  {
    id: 2,
    title: "キングダム",
    cover_url: "/new-covers/cover-2.webp",
    description:
      "時は紀元前――。いまだ一度も統一されたことのない中国大陸は、500年の大戦争時代。苛烈な戦乱の世に生きる少年・信は、自らの腕で天下に名を成すことを目指す!! 2013年、第17回手塚治虫文化賞マンガ大賞受賞!",
    likes: 5640,
    amazon_url: "https://amzn.to/3ZpPF5V",
  },
  {
    id: 3,
    title: "君と宇宙を歩くために",
    cover_url: "/new-covers/cover-3.webp",
    description:
      "ヤンキーの小林は、勉強もバイトも続かず悩んでいたが、転校生の宇野と出会い、彼の生き方に惹かれる。宇野に助けられたことをきっかけに、2人の距離が縮まり、小林は自分を変えようと奮闘する。正反対の2人が互いに壁にぶつかりながらも成長していく友情物語。",
    likes: 234,
    amazon_url: "https://amzn.to/47vsGsa",
  },
  {
    id: 4,
    title: "トリリオンゲーム",
    cover_url: "/new-covers/cover-4.webp",
    description:
      "稲垣理一郎&池上遼一の最強タッグ!! 1,000,000,000,000$稼いで、この世の全てを手に入れろ! 世界一のワガママ男・ハルと、まじめなガク。最強の二人がゼロから起業、ミラクルを起こす!! グーグル、アマゾン、マイクロソフトを喰う! 『Dr.STONE』の稲垣理一郎と『サンクチュアリ』の池上遼一が放つ、最新にして最高! スタートアップコミックの決定版、誕生!!",
    likes: 2963,
    amazon_url: "https://amzn.to/3XKXLVs",
  },
  {
    id: 5,
    title: "ブルーピリオド",
    cover_url: "/new-covers/cover-5.webp",
    description:
      "成績優秀かつスクールカースト上位の充実した毎日を送りつつ、どこか空虚な焦燥感を感じて生きる高校生・矢口八虎（やぐち やとら）は、ある日、一枚の絵に心奪われる。その衝撃は八虎を駆り立て、美しくも厳しい美術の世界へ身を投じていく。",
    likes: 3451,
    amazon_url: "https://amzn.to/3MS60c2",
  },
  {
    id: 6,
    title: "ガンニバル",
    cover_url: "/new-covers/cover-6.webp",
    description:
      "山間の村「供花村」に赴任してきた駐在・阿川大悟。村の人々は大悟一家を暖かく受け入れるが、一人の老婆が遺体で見つかり、大悟は村の異常性に徐々に気付き、ある疑念に囚われる…。「この村の人間は人を喰ってる」──。次々と起きる事件、村に充満する排除の空気、一息も尽かせぬ緊迫感で放つ、驚愕・戦慄の“村八分”サスペンス堂々開幕!!",
    likes: 1849,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 7,
    title: "北北西に曇と往け",
    cover_url: "/new-covers/cover-7.webp",
    description:
      "舞台はアイスランド島、北緯64度のランズ・エンド。 17歳の主人公・御山慧には3つの秘密があった。 ひとつ、クルマと話ができる。ふたつ、美人な女の子が苦手。 ３つ、その職業は、探偵――。 あるときは逃げ出した飼い犬を連れ戻し、 またあるときはひと目ぼれの相手を探し出す。 愛車ジムニーを駆りながら、 胸のすくような探偵活劇が、いま始まる！ 若き魔法使いの成長を描いた『乱と灰色の世界』から２年。入江亜季の最新作は極北の大地が舞台の“エブリデイ・ワンダー”!!",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 8,
    title: "ケンガンアシュラ",
    cover_url: "/new-covers/cover-8.webp",
    description:
      "家庭は崩壊、仕事はできない56歳のダメリーマン、山下一夫(ヤマシタカズオ)が会社の会長から突然呼び出された！弱気なおっさん・山下一夫は、日本経済の「裏」を知る――企業が巨額の利益を賭けて、雇った闘技者の殴り合いでビジネスを決める格闘試合の存在。…その名も「拳願仕合(ケンガンジアイ)」!!!!そして一夫に命じられた任務は――自社の闘技者、暴力を体現したような若者・十鬼蛇王馬（トキタオウマ）の世話係!!!果たして、ダメリーマン・山下一夫の運命は…!!??暴力×企業×人間ドラマ。男たちは「なぜ」闘い、拳で「何」をつかむのか？「究極」の格闘エンターテインメントが今、始まるッ!!!!",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 9,
    title: "軍鶏",
    cover_url: "/new-covers/cover-9.webp",
    description:
      "真昼の昼下がり、少年は両親を殺害した。エリート銀行員の父と美しき母の、まとわりつくような愛情が、自分のすべてを吸い尽くすという妄執にかられ、少年は凶行に及んだ。収監された少年院で、少年は「空手」と出会い、その牙と爪を研ぎ続ける。何者にも自分自身を奪われないため、何より、殺されないためにーー。",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 10,
    title: "女の園の星",
    cover_url: "/new-covers/cover-10.webp",
    description:
      "「声を出して笑った」の声、続出!!!漫画賞総ナメ『夢中さ、きみに。』の和山やま初連載！ある女子校、２年４組担任・星先生。生徒たちが学級日誌で繰り広げる絵しりとりに翻弄され、教室で犬のお世話をし、漫画家志望の生徒にアドバイス。時には同僚と飲みに行く…。な～んてことない日常が、なぜこんなにも笑えて愛おしいんでしょう!?どんな時もあなたを笑わせる未体験マンガ、お確かめあれ！電子版にも本体表紙を収録！",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 11,
    title: "スキップとローファー",
    cover_url: "/new-covers/cover-11.webp",
    description:
      "岩倉美津未、今日から東京の高校生！ 入学を機に地方から上京した彼女は、勉強こそできるものの、過疎地育ちゆえに同世代コミュ経験がとぼしい。そのうえちょっと天然で、慣れない都会の高校はなかなかムズカシイ！ だけど、そんな「みつみちゃん」のまっすぐでまっしろな存在感が、本人も気づかないうちにクラスメイトたちをハッピーにしていくのです！",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
  {
    id: 12,
    title: "プロミス・シンデレラ",
    cover_url: "/new-covers/cover-12.webp",
    description:
      "Ｔｗｉｔｔｅｒ騒然！年の差ラブストーリーつつましく、平穏な暮らしを送る専業主婦の早梅。彼女の前に現れたのは、性格の悪そうな金持ちの男子高生・壱成。この男との出会いが早梅の人生を一変させる…。不倫され離婚、スリにあい路上生活を余儀なくされる早梅。“人生”に必要なのは愛か、金か、それとも運か――!!?銭が紡ぐ、アラサー女子と男子高校性の”リアル人生ゲーム”がはじまる!!#バツイチアラサー女子と男子高校生をはじめ、pixivやtwitterで超話題の新人・橘オレコ氏の初連載作、ついにコミックス化!!",
    likes: 3540,
    amazon_url: "https://amzn.to/3B8od2l",
  },
];

export { mangadatas, users, userlikes };
