const users = [
  {
    id: "410544b2-4001-4271-9855-fec4b6a6442a",
    name: "User",
    email: "user@nextmail.com",
    password: "123456",
  },
];

const userlikes = [
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 1 },
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 3 },
  { id: 1, user_id: "410544b2-4001-4271-9855-fec4b6a6442a", manga_id: 6 },
];

const mangadatas = [
  {
    id: 1,
    title: "親愛なる君へ殺意を込めて",
    cover_url: "/new-covers/cover-1.webp",
    description:
      "「人生は楽しんだもん勝ち」がモットーの大学生・浦島エイジ。だが彼は、人には言えない“過酷な運命”を背負っていた。その現実と向き合った時、彼は惨劇に巻き込まれていく―――。",
    likes: 1340,
  },
  {
    id: 2,
    title: "キングダム",
    cover_url: "/new-covers/cover-2.webp",
    description:
      "時は紀元前――。いまだ一度も統一されたことのない中国大陸は、500年の大戦争時代。苛烈な戦乱の世に生きる少年・信は、自らの腕で天下に名を成すことを目指す!! 2013年、第17回手塚治虫文化賞マンガ大賞受賞!",
    likes: 5640,
  },
  {
    id: 3,
    title: "君と宇宙を歩くために",
    cover_url: "/new-covers/cover-3.webp",
    description:
      "ヤンキーの小林は、勉強もバイトも続かず悩んでいたが、転校生の宇野と出会い、彼の生き方に惹かれる。宇野に助けられたことをきっかけに、2人の距離が縮まり、小林は自分を変えようと奮闘する。正反対の2人が互いに壁にぶつかりながらも成長していく友情物語。",
    likes: 234,
  },
  {
    id: 4,
    title: "トリリオンゲーム",
    cover_url: "/new-covers/cover-4.webp",
    description:
      "稲垣理一郎&池上遼一の最強タッグ!! 1,000,000,000,000$稼いで、この世の全てを手に入れろ! 世界一のワガママ男・ハルと、まじめなガク。最強の二人がゼロから起業、ミラクルを起こす!! グーグル、アマゾン、マイクロソフトを喰う! 『Dr.STONE』の稲垣理一郎と『サンクチュアリ』の池上遼一が放つ、最新にして最高! スタートアップコミックの決定版、誕生!!",
    likes: 2963,
  },
  {
    id: 5,
    title: "ブルーピリオド",
    cover_url: "/new-covers/cover-5.webp",
    description:
      "成績優秀かつスクールカースト上位の充実した毎日を送りつつ、どこか空虚な焦燥感を感じて生きる高校生・矢口八虎（やぐち やとら）は、ある日、一枚の絵に心奪われる。その衝撃は八虎を駆り立て、美しくも厳しい美術の世界へ身を投じていく。",
    likes: 3451,
  },
  {
    id: 6,
    title: "ガンニバル",
    cover_url: "/new-covers/cover-6.webp",
    description:
      "山間の村「供花村」に赴任してきた駐在・阿川大悟。村の人々は大悟一家を暖かく受け入れるが、一人の老婆が遺体で見つかり、大悟は村の異常性に徐々に気付き、ある疑念に囚われる…。「この村の人間は人を喰ってる」──。次々と起きる事件、村に充満する排除の空気、一息も尽かせぬ緊迫感で放つ、驚愕・戦慄の“村八分”サスペンス堂々開幕!!",
    likes: 1849,
  },
];

export { mangadatas, users, userlikes };
